In [1]:
import numpy as np
import pandas as pd

# Series  
Series one dimensional data

In [8]:
labels = ['a','b','c']
lst = [10,20,30]

In [9]:
pd.Series(data = lst)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = lst, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(lst, labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(np.array([10,20,30]), labels)

a    10
b    20
c    30
dtype: int32

In [14]:
pd.Series({'a':10, 'b':20, 'c':30}) #dictionary

a    10
b    20
c    30
dtype: int64

In [15]:
ser1 = pd.Series([1,2,3,4], index=['USA','Germany','USSR','Japan'])
ser2 = pd.Series([1,2,5,4], index=['USA','Germany','Italy','Japan'])

In [16]:
ser1['Germany']

2

In [17]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrame

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101) #same random number each time
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [73]:
np.random.seed(101)
df = pd.DataFrame(randn(5,4), index = list('ABCDE'), columns = list('WXYZ'))
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

DataFrame consists of Series. Each line and each column is series.

In [24]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [26]:
df[['W', 'Y']] #first parametr is a list!

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579
C  2.154846 -0.755325
D  0.147027  0.558769
E -0.925874 -1.133817

In [28]:
df[['W']] #if first parametr is a list then you get a DATAFRAME not a SERIES

          W
A -0.993263
B  1.025984
C  2.154846
D  0.147027
E -0.925874

In [38]:
df['NEW'] = df['W'] + df['X']
df

           W         X         Y         Z        NEW
A  10.000000  0.196800 -1.136645  0.000366  10.196800
B   1.025984 -0.156598 -0.031579  0.649826   0.869386
C   2.154846 -0.610259 -0.755325 -0.346419   1.544588
D   0.147027 -0.479448  0.558769  1.024810  -0.332421
E  -0.925874  1.862864 -1.133817  0.610478   0.936990

### DROP

#### If you wanna drop row axis=0, otherwise(column) axis=1

In [39]:
df.drop('NEW', axis=1)

           W         X         Y         Z
A  10.000000  0.196800 -1.136645  0.000366
B   1.025984 -0.156598 -0.031579  0.649826
C   2.154846 -0.610259 -0.755325 -0.346419
D   0.147027 -0.479448  0.558769  1.024810
E  -0.925874  1.862864 -1.133817  0.610478

In [40]:
df

           W         X         Y         Z        NEW
A  10.000000  0.196800 -1.136645  0.000366  10.196800
B   1.025984 -0.156598 -0.031579  0.649826   0.869386
C   2.154846 -0.610259 -0.755325 -0.346419   1.544588
D   0.147027 -0.479448  0.558769  1.024810  -0.332421
E  -0.925874  1.862864 -1.133817  0.610478   0.936990

#### If you wanna really drop

In [41]:
df = df.drop('NEW', axis=1) #undesirable
df

           W         X         Y         Z
A  10.000000  0.196800 -1.136645  0.000366
B   1.025984 -0.156598 -0.031579  0.649826
C   2.154846 -0.610259 -0.755325 -0.346419
D   0.147027 -0.479448  0.558769  1.024810
E  -0.925874  1.862864 -1.133817  0.610478

In [44]:
df['NEW'] = df['W'] + df['X']
df.drop('NEW', axis=1, inplace = True) #Instead use it!!!
df

           W         X         Y         Z
A  10.000000  0.196800 -1.136645  0.000366
B   1.025984 -0.156598 -0.031579  0.649826
C   2.154846 -0.610259 -0.755325 -0.346419
D   0.147027 -0.479448  0.558769  1.024810
E  -0.925874  1.862864 -1.133817  0.610478

### Change a value

In [45]:
df.loc['A', 'W'] = 10
df

           W         X         Y         Z
A  10.000000  0.196800 -1.136645  0.000366
B   1.025984 -0.156598 -0.031579  0.649826
C   2.154846 -0.610259 -0.755325 -0.346419
D   0.147027 -0.479448  0.558769  1.024810
E  -0.925874  1.862864 -1.133817  0.610478

iloc - index  
loc - name

In [46]:
df.loc[['A', 'B'], ['W','Z']]

           W         Z
A  10.000000  0.000366
B   1.025984  0.649826

## Filter

In [47]:
df>0

       W      X      Y      Z
A   True   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [48]:
df[df>0]

           W         X         Y         Z
A  10.000000  0.196800       NaN  0.000366
B   1.025984       NaN       NaN  0.649826
C   2.154846       NaN       NaN       NaN
D   0.147027       NaN  0.558769  1.024810
E        NaN  1.862864       NaN  0.610478

In [49]:
df['W']>0

A     True
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [52]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
(df['W']>0) & (df['Y']>1)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [54]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

SHIFT+TAB

In [76]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [77]:
df.set_index('States', inplace=True)
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# NaN

In [79]:
new_df = pd.DataFrame({
    'A': [1,2,np.nan,7],
    'B': [5, np.nan, np.nan,8],
    'C': [1,2,3,9],
})
new_df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  7.0  8.0  9

### Drop not a number

In [80]:
new_df.dropna()

     A    B  C
0  1.0  5.0  1
3  7.0  8.0  9

In [82]:
#drop if NaN>=2
new_df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  7.0  8.0  9

### Fill

In [84]:
new_df.fillna('PYTHON')

        A       B  C
0       1       5  1
1       2  PYTHON  2
2  PYTHON  PYTHON  3
3       7       8  9

In [86]:
new_df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  7.0  8.0  9

In [91]:
new_df['A'].fillna(value = new_df['A'].mean(), inplace=True)

In [92]:
new_df

          A    B  C
0  1.000000  5.0  1
1  2.000000  NaN  2
2  3.333333  NaN  3
3  7.000000  8.0  9